package com.leetcodingquest.pipeline.FermatsLittleTheorem._1569NumbersOfWayaToReaorderArrayToGetSameBST;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

// время O(n^2) - построение таблицы Паскаля, память O(n^2) - таблица биномиальных коэффициентов,
// рекурсивные списки и стек занимаются не более O(n^2) в худшем случае
public class Solution1 {
    // модуль, по которому необходимо вычислять ответ
    private static final int MOD = 1_000_000_007;
    // двумерный массив для хранения биномиальных коэффициентов
    private long[][] combinations;

    public int numOfWays(int[] nums) {
        // определяем длину входящего массива
        int n = nums.length;
        // создаём таблицу для биномиальных коэффициентов
        // размер n + 1 потому, что нужно обращаться к строке с номером n включительно
        combinations = new long[n + 1][n + 1];
        // Построение треугольника Паскаля
        for (int i = 0; i <= n; i++) {
            // сначал заполняются первые элементы строки и диагональные элементы: внутренние элементы строки
            combinations[i][0] = 1;
            combinations[i][i] = 1;
            // затем заполняются остальные элементы ниже диагонали, между крайними единицами
            // операция % MOD не позволяет значениям в таблице расти бесконтрольно
            for (int j = 1; j < i; j++) {
                combinations[i][j] = (combinations[i - 1][j - 1] + combinations[i - 1][j]) % MOD;
            }
        }
        /** Пример
         * [1, 0, 0, 0]
         * [1, 1, 0, 0]
         * [1, 2, 1, 0]
         * [1, 3, 3, 1]
         */
        // В итоге получаем готовую таблицы, из которой за О(1) можно получать нужный биномиальный коэффициент
        // Создаём вспомогательный список values для рекурсивных вызовов и переносим в него все числа из массива
        List<Integer> values = new ArrayList<>();
        for (int num : nums) {
            values.add(num);
        }
        // Вызов countWays возвращает общее количество порядков, создающих нужное дерево, включая исходный порядок
        // Вычитаем 1, чтобы исключить исходный порядок, который мы считаем
        // Добавление MOD гарантирует неотрицательный результат (1 - 1 + MOD), а остаток от деления не равен нуля
        return (int) ((countWays(values) - 1 + MOD) % MOD);
    }
    // рекурсивный метод
    private long countWays(List<Integer> nums) {
        // Базовый случай: если 0 или 1 элемент, то 1 способ, сначала получаем количество элементов текущего списка
        int n = nums.size();
        // если элементов не более двух, то только один способ построить соответствующее дерево
        if (n <= 2) return 1;
        // Первый элемент становится корнем. Для сохранения идентичного дерева он должен остаться первым
        int root = nums.get(0);
        // Создаём два пусых списка: для левого и правого поддеревьев
        List<Integer> left = new ArrayList<>();
        List<Integer> right= new ArrayList<>();
        // Цикл начинается с индекса 1, поскольку элемент с индексом 0 уже явлется корнем
        // Разделяем элементы на левые и правые поддеревья
        for (int i = 1; i < n; i++) {
            int value = nums.get(i);
            // Для каждого оставшегося элемента если value < root
            if (value < root) {
                left.add(value);  // то добавляем число в left
            } else {
                right.add(value); // Иначе добавляем в right
            }
            // Все числа уникальны, поэтому равенство корню быть не может
        }
        /** Пример
         * root  = 3
         * left  = [1, 2]
         * right = [4, 5]
         */
        // Рекурсивно решаем ту же задачу для каждого: левого и правого поддеревьев
        long leftWays = countWays(left);    // число порядков, которые сохраняют структуру левого поддерева
        long rightWays = countWays(right);  // число порядков, которые сохраняют структуру правого поддерева
        // Каждый рекурсивный вызов делит свой список на ещё меньшие группы, пока не дойдёт до списков длины 1 или 2

        // Считаем способы перемешивания:
        // После фиксации корня остаётся n-1 элементов
        // Из них left.size() позиций нужно выделить для элементов левого поддерева
        // Все остальные позиции займут элементы правого поддерева
        long interleavings = combinations[n-1][left.size()]; // это значение находится по индексам в таблице Паскаля
        // Вычисляем биномиальный коэффициент: перемножаем три независимых составляющих:
        // interleavings - количество вариантов чередования двуз групп
        // leftWays - количество допустимых порядков левой группы
        // rightWays - количество допустимых порядков правой группы
        // далее берём остаток по модулю для исбежанияч переполнения long
        return (((interleavings * leftWays) % MOD) * rightWays) % MOD;
    }

    public static void main(String[] args) {
        Solution1 solution1 = new Solution1();

        int[][] tests = {
            {2, 1, 3},
            {3, 4, 5, 1, 2},
            {1, 2, 3}
        };

        int[] expected = {1, 5, 0};

        for (int i = 0; i < tests.length; i++) {
            int result = solution1.numOfWays(tests[i]);

            System.out.println(
                "Input: " + Arrays.toString(tests[i])
                + " | Expected: " + expected[i]
                + " | Received: " + result
            );
        }
    }
}
