package com.leetcodingquest.pipeline.HashTable._13RomanToInteger;

public class Solution {
    // время O(n), память O(1)
    // Принимает римское число и возвращает его целочисленное значение
    public int romanToInt(String s) {
        int sum = 0;    // Создаём переменную для хранения итоговой суммы; изначально сумма равна нулю
        for (int i = 0; i < s.length(); i++) {  // Перебираем строку слева направо, от первого символа до последнего
            int current = getValue(s.charAt(i));    // Получаем числовое значение текущего символа
            if (i + 1 < s.length()){    // Проверяем, существует ли следующий символ, чтобы не выйти за границы строки
                int next = getValue(s.charAt(i + 1));   // Получаем числовое значение следующего символа
                if (current < next){ // Если текущий символа меньше следующего, перед нами случай вычитания
                    sum -= current; // Вычитаем значение текущего символа из общей суммы
                } else {    // Если текущий символ больше или равен следующему, выполняем сложение
                    sum += current; // Прибавляем значение текущего символа к общей сумме
                }   // Завершаем проверку правила сложения или вычитания
            } else {    // Если следующего символа нет, значит, обрабатываем последний символ строки
                sum += current; // Прибавляем значение последнего символа к общей сумме
            }   // Завершаем проверку наличия следующего символа
        }
        return sum; // Возвращаем полученное целое число
    }

    private int getValue(char symbol) { // Создаём вспомогательный метод для преобразования символа в число
        switch (symbol) {    // Выбираем числовое значение в зависимости от переданного символа
            case 'I':
                return 1; // Для символа I возвращаем единицу
            case 'V':
                return 5; // Для символа V возвращаем единицу
            case 'X':
                return 10; // Для символа X возвращаем единицу
            case 'L':
                return 50; // Для символа L возвращаем единицу
            case 'C':
                return 100; // Для символа C возвращаем единицу
            case 'D':
                return 500; // Для символа D возвращаем единицу
            case 'M':
                return 1000; // Для символа M возвращаем единицу

            default:
                return 0;  // Возвращаем ноль для неизвестного символа; по условию он не встретится
        } // завершаем switch
    }   // Завершает метод getValue

    public static void main(String[] args) {
        String s = "III";
        System.out.println(new Solution().romanToInt(s)); // 3
        String s1 = "LVIII";
        System.out.println(new Solution().romanToInt(s1)); // 58
        String s2 = "MCMXCIV";
        System.out.println(new Solution().romanToInt(s2)); // 1994
    }
}   // Завершаем класс Solution
