package com.leetcodingquest.pipeline.UnionFind._1254NumberOfClosedIslands;

public class Solution1 {
    // время O(m*n), память O(m*n)
    // Метод возвращает количество закрытых островов
    public int closedIsland(int[][] grid) {
        int rows = grid.length; // Сохраняем количество строк массива
        int cols = grid[0].length;  // Сохраняем количество столбцов массива
        int closedIslands = 0;  // Счётчик закрытых островов, изначально острово нет
        // Создаём  стек, вмещающий все ячейки массива
        int[] stack = new int[rows * cols];
        // Перебираем строки сверху вниз
        for (int r = 0; r < rows; r++) {
            // Перебираем столбцы слева направо
            for (int c = 0; c < cols; c++) {
                if (grid[r][c] == 0){   // Если нашли ещё не обработанную ячейку суши
                    int top = 0;    // Индекс вершины стека, пока стек пуст
                    boolean isClosed = true;    // Предполагаем, что остров закрытый
                    stack[top++] = r * cols + c;    // Кодируем координаты и помещаем ячейку в стек
                    grid[r][c] = 1; // Помечаем ячейку как посещённую, чтобы не добавлять её повторно

                    while (top > 0){    // Пока в стеке остаются ячейки без обработки
                        int position = stack[--top];    // Извлекаем координаты последней добавленной ячейки
                        int currentRow = position / cols;   // Восстанавливаем номер строки из кода
                        int currentCol = position % cols;    // Восстанавливаем номер столбца из кода

                        if (currentRow == 0 // Проверяем, находится ли ячейка на верхней границе
                                || currentRow == rows - 1   // Проверяем нижнюю границу
                                || currentCol == 0  //  Проверяем левую границу
                                || currentCol == cols - 1) {    // Проверяем правую границу
                            isClosed = false;   // Остров касается края, поэтому оне не закрытый
                        }   // Завершаем проверку границ

                        if (currentRow > 0  // Проверяем, существует ли ячейка сверху
                                && grid[currentRow - 1][currentCol] == 0) { // Проверяем, является ли сушей
                            stack[top++] = (currentRow - 1) * cols + currentCol;    // Добавляем верхнего соседа в стек
                            grid[currentRow - 1][currentCol] = 1;   // Сразу помечаем соседа как посещённого
                        }   // Завершаем обработку верхнего соседа

                        if (currentRow < rows - 1   // Проверяем, существует ли ячейка
                                && grid[currentRow + 1][currentCol] == 0){  // Проверяем является ли она сушей
                            stack[top++] = (currentRow + 1) * cols + currentCol;    // Добавляем нижнего соседа в стек
                            grid[currentRow + 1][currentCol] = 1;   // Помечаем нижнего соседа как посещённого
                        }   // Завершаем обработку нижнего соседа

                        if (currentCol > 0  // Проверяем, существует ли ячейка слева
                                && grid[currentRow][currentCol - 1] == 0){  // Проверяем, является ли она сушей
                            stack[top++] = currentRow * cols + currentCol - 1;  // Добавляем левого соседа в стек
                            grid[currentRow][currentCol - 1] = 1;   // Помечаем левого соседа как посещённого
                        }   // Завершаем обработку левого соседа

                        if (currentCol < cols - 1   // Проверяем, существует ли ячейка справа
                                && grid[currentRow][currentCol + 1] == 0){  // Проверяем, является ли она сушей
                            stack[top++] = currentRow * cols + currentCol + 1;  // Добавляем правого соседа в стек
                            grid[currentRow][currentCol + 1] = 1;   // Помечаем правого соседа как посещённого
                        }   // Завершаем обработку правого соседа

                    } // Завершаем обход всех ячеек текущего острова
                    if (isClosed) { // Если ни одна ячейка острова не коснулась границы
                        closedIslands++;    // Увеличиваем количество закрытых островов на единицу
                    }   // Завершаем проверку закрытости острова
                }   // Завершаем обработку найденной ячейки суши
            }   // Завершаем перебор столбцов текущей строки
        }   // Завершаем перебор все строк
        return closedIslands;   // Возвращаем итоговое количество закрытых острово
    }

    public static void main(String[] args) {
        Solution1 solution = new Solution1(); // Создаём объект решения.

        int[][] grid1 = { // Пример 1.
                {1, 1, 1, 1, 1, 1, 1, 0}, // Строка 0.
                {1, 0, 0, 0, 0, 1, 1, 0}, // Строка 1.
                {1, 0, 1, 0, 1, 1, 1, 0}, // Строка 2.
                {1, 0, 0, 0, 0, 1, 0, 1}, // Строка 3.
                {1, 1, 1, 1, 1, 1, 1, 0}  // Строка 4.
        };

        int[][] grid2 = { // Пример 2.
                {0, 0, 1, 0, 0}, // Строка 0.
                {0, 1, 0, 1, 0}, // Строка 1.
                {0, 1, 1, 1, 0}  // Строка 2.
        };

        int[][] grid3 = { // Пример 3.
                {1, 1, 1, 1, 1, 1, 1}, // Строка 0.
                {1, 0, 0, 0, 0, 0, 1}, // Строка 1.
                {1, 0, 1, 1, 1, 0, 1}, // Строка 2.
                {1, 0, 1, 0, 1, 0, 1}, // Строка 3.
                {1, 0, 1, 1, 1, 0, 1}, // Строка 4.
                {1, 0, 0, 0, 0, 0, 1}, // Строка 5.
                {1, 1, 1, 1, 1, 1, 1}  // Строка 6.
        };

        System.out.println(solution.closedIsland(grid1)); // 2
        System.out.println(solution.closedIsland(grid2)); // 1
        System.out.println(solution.closedIsland(grid3)); // 2
    }
}
